
class typoSyn():
    typoDict = {
        "低卡可樂": ["Zero", "纖維可樂"],
        "汽水": ["雪碧"],
        "小卷": ["小捲", "小管", "透抽", "中卷", "鎖管"],
        "牡蠣": ["蚵仔", "生蠔", "蠔"],
        "干貝": ["甘貝", "瑤柱", "帶子粒"],
        "鮮貝": ["帶子", "沙插", "騷蛤"],
        "扇貝": ["凡立貝", "帆立貝"],
        "燻雞": ["燻G"],
        "雞蛋": ["Egg"],
        "肉乾": ["Jerky"],
        "春捲": ["春卷"],
        "綠卷": ["綠捲"],
        "豆芽菜": ["銀芽"],
        "九層塔": ["蘿勒"],
        "胡蘿蔔": ["紅蘿絲", "紅蘿蔔", "甘荀"],
        "蘿蔓": ["羅曼", "羅美", "蘿美", "美蘿心"],
        "香菜": ["芫荽", "蕃荽", "胡妥", "芫茜", "鹽須"],
        "蘋果": ["Apple"],
        "鳳梨": ["蘿菠", "菠萝"],
        "番茄": ["蕃茄", "番茄tomato"],
        "櫻桃茄": ["櫻桃茄cherrytomato"],
        "梨子": ["雪梨"],
        "檸檬": ["青寧", "台灣好田"],
        "芒果": ["青芒"],
        "草莓": ["士多啤梨"],
        "柚子": ["文旦"],
        "奇異果": ["猕猴桃"],
        "酪梨": ["Avocado"],
        "葵花籽": ["葵花子"],
        "核桃": ["胡桃", "Walnut"],
        "杏仁": ["南北杏", "南杏"],
        "大麻籽": ["大麻子"],
        "亞麻": ["胡麻"],
        "亞麻籽": ["亞麻子"],
        "奇亞籽": ["奇亞子", "奇芽籽"],
        "奧勒岡": ["奧利岡", "俄力岡"],
        "穀片": ["穀物片"],
        "小米": ["Arborio", "庫司庫司", "庫斯庫斯"],
        "玉米": ["玉蜀黍"],
        "甘薯": ["甘藷", "地瓜", "沙葛"],
        "鷹嘴豆": ["Hummus"],
        "蠶豆": ["Broad"],
        "蒔蘿": ["洋茴香"],
        "甜菊": ["Stevia"],
        "薄菏": ["簿荷"],
        "明膠": ["吉利丁"],
        "銀耳": ["白木耳", "雪耳"],
        "車前": ["前車"],
        "孜然": ["cumin"],
        "香莢蘭": ["雲呢拿"],
        "山葵": ["綠芥末", "wasabi", "哇沙米"],
        "芥末": ["芥末mustard"],
        "莎莎醬": ["Salsa"],
        "味精": ["味素"],
        "鮮奶油": ["忌廉", "動鮮"],		# 動物性鮮奶油
        "博康奇尼": ["Bocconcini"],
        "莫茲瑞拉": ["莫札瑞拉", "mozzarella"],
        "瑞可達": ["Ricotta"],
        "乳酪": ["起司"],
        "蒟蒻": ["蒟篛"],
        "發粉": ["泡打粉"],
        "蘇打": ["梳打"],
        "辣木": ["青汁"],
        "煙燻": ["煙熏"]
    }

    def __init__(self):
        self._lookup = {}
        for item, values in self.typoDict.items():
            for val in values:
                self._lookup[val] = item
        self._lookup = sorted(self._lookup.items(), key=lambda x:len(x[0]), reverse=True)

    def replaceTypo(self, value):
        for typo, key in self._lookup:
            if typo in value:
                return value.replace(typo, key)
        return value


class groupSyn():
    Synonym = [
        "蔘鬚",
        "黃耆",
        "熟地",
        "甘草",

        "伏特加",
        "低卡可樂",
        "可樂",
        "汽水",
       ["優格", "Greek"],
        "養樂多",
        "冰淇淋",
       ["黃布丁", "布丁"],

        "海鮮",
        "小卷",
        "軟絲",
        "牡蠣",
        "干貝",
        "扇貝",
       ["魚翅", "北海翅"],
       ["鮭魚", "鱒澳鱸"],
       ["鰻魚", "蒲燒鰻"],

        "漢堡排",
       ["豬肉", "火鍋片"],
       ["雞胸肉", "金豐盛", "燻雞"],
        "雞蛋",
       ["高蛋白", "protein"],
       ["羊肉", "羊排"],
        "肉乾",

        "魔芋面",
       ["麵", "雁门清高黑苦荞全麦龙须面"],
       ["麵包", "漢堡包", "軟法", "餐包", "銀絲卷", "三文治方", "新英格蘭堡"],
        "饅頭",

       ["麵皮", "餛飩皮", "春捲皮"],
       ["塔皮", "派皮"],

       ["乾酪", "帕馬森"],
       ["乳酪", "瑞可達", "博康奇尼", "莫茲瑞拉", "馬斯卡朋", "布拉塔"],
       ["無鹽奶油"],
       ["鮮奶油"],
       ["奶油"],

       ["餅乾", "OREO", "洋芋片", "樂事原味波卡", "浪味仙", "奇多"],
       ["巧克力", "Hersheys", "COCO"],

       ["蔬菜", "綠橡木葉", "時蔬", "冰山綠火焰", "韭黃", "青花苔"],
        "綠卷",
        "豆芽菜",
        "九層塔",
        "胡蘿蔔",
        "蘿蔓",

        "香菜",

       ["大番茄", "牛番茄"],
       ["小番茄", "車厘茄", "聖女番茄"],
        "蘋果",
        "鳳梨",
        "草莓",
        "梨子",
        "榴槤",
        "檸檬",
        "櫻桃",
        "波羅蜜",
        "芒果",
        "李子",
        "柚子",
        "桑葚",
        "石榴",
        "奇異果",
        "酪梨",

       ["果乾", "蔓越梅乾"],
       ["梅子", "烏梅", "梅乾"],

        "堅果",
        "葵花籽",
        "核桃",
        "杏仁",
        "大麻籽",
        "亞麻籽",
        "奇亞籽",
       ["麥片", "穀片"],

        "小米",
        "玉米",
        "甘薯",
        "荸齊",
        "菱角",
        "蓮藕",

        "鷹嘴豆",
        "蠶豆",

        "蒔蘿",
       ["食用花", "花片", "茉莉"],
        "甜菊",
        "梔子花",
        "香蜂草", 
        "斑蘭",
        "薄菏",
        "番紅花",

        "尾冬骨",
       ["明膠", "洋菜", "果凍粉", "膠粉", "蒟蒻", "寒天"],
        "月桂",
       ["木耳", "銀耳"],
        "松茸",
        "松露",
        "玉子燒",
        "紅珊瑚",
        "維他命C",
        "腐皮",

        "奧勒岡",
       ["車前子", "洋車前"],
       ["香料", "葛縷子", "葫蘆巴", "香莢蘭"],
        "孜然",
        "茴香",

        "山葵",
        "辣根",

       ["美乃滋", "KEPIE"],
        "莎莎醬",

       ["調味料", "滷汁包", "風味料"],
       ["高湯塊", "麻辣鍋底"],
        "味精",
       ["醋", "balsamic"],
       ["醬料", "老乾媽"],
       ["醬油", "滷汁"],
        "蔭豉",
        "破布子",
        ]

    def __init__(self):
        self.dict = {}
        # dicN = {}
        for item in self.Synonym:
            if isinstance(item, list):
                self.dict[item[0]] = item[:]
                # for i in item:
                #     ilen = str(len(i)).zfill(2)
                #     if not ilen in dicN:
                #         dicN[ilen]=[[i,item[0]]]
                #     else:
                #         dicN[ilen].append([i,item[0]])
            else:
                self.dict[item] = [item]
        # self.dicN = [dicN[i] for i in keys()]


    def lookup(self, item, values):
        for sym in values:
            if sym == item:
                return True, False
            elif sym in item:
                return True, True
        else:
            return False, False
